package top.yunp.safe_demo.safe_b;

public class Safe_Test {

    /**
     * 需求： 通过多线程模拟抢红包操作
     *
     * 分析：
     *      红包： 变量  int  100
     *      抢红包的人：  Thread
     *            每个人可用无限次强红包  为了方便 每次只能抢到1元
     */

    public static void main(String[] args)
    {

        Person_Runnable p1 = new Person_Runnable();
        Thread th1 = new Thread(p1);
        th1.start();

        Person_Runnable p2 = new Person_Runnable();
        Thread th2 = new Thread(p2);
        th2.start();

        Person_Runnable p3 = new Person_Runnable();
        Thread th3 = new Thread(p3);
        th3.start();

        Person_Runnable p4 = new Person_Runnable();
        Thread th4 = new Thread(p4);
        th4.start();

        Person_Runnable p5 = new Person_Runnable();
        Thread th5 = new Thread(p5);
        th5.start();


//        红包剩余：97
//        红包剩余：96
//        红包剩余：97
//        红包剩余：97
//        红包剩余：94
//        红包剩余：95
//        红包剩余：92
//        红包剩余：93
//        红包剩余：90
//        红包剩余：91
//        红包剩余：88
//        红包剩余：89
//        红包剩余：86
//        红包剩余：87
//        红包剩余：84
//        红包剩余：85
//        红包剩余：82
//        红包剩余：83
//        红包剩余：80
//        红包剩余：81
//        红包剩余：78
//        红包剩余：79
//        红包剩余：76
//        红包剩余：77
//        红包剩余：74
//        红包剩余：75
//        红包剩余：72
//        红包剩余：73
//        红包剩余：70
//        红包剩余：68
//        红包剩余：71
//        红包剩余：67
//        红包剩余：69
//        红包剩余：65
//        红包剩余：66
//        红包剩余：63
//        红包剩余：64
//        红包剩余：61
//        红包剩余：62
//        红包剩余：59
//        红包剩余：60
//        红包剩余：57
//        红包剩余：58
//        红包剩余：55
//        红包剩余：56
//        红包剩余：53
//        红包剩余：54
//        红包剩余：51
//        红包剩余：52
//        红包剩余：49
//        红包剩余：50
//        红包剩余：47
//        红包剩余：48
//        红包剩余：45
//        红包剩余：46
//        红包剩余：43
//        红包剩余：44
//        红包剩余：41
//        红包剩余：42
//        红包剩余：39
//        红包剩余：40
//        红包剩余：37
//        红包剩余：38
//        红包剩余：35
//        红包剩余：36
//        红包剩余：33
//        红包剩余：34
//        红包剩余：31
//        红包剩余：32
//        红包剩余：29
//        红包剩余：30
//        红包剩余：27
//        红包剩余：28
//        红包剩余：25
//        红包剩余：26
//        红包剩余：23
//        红包剩余：24
//        红包剩余：21
//        红包剩余：22
//        红包剩余：19
//        红包剩余：20
//        红包剩余：17
//        红包剩余：18
//        红包剩余：15
//        红包剩余：16
//        红包剩余：13
//        红包剩余：14
//        红包剩余：11
//        红包剩余：12
//        红包剩余：9
//        红包剩余：10
//        红包剩余：7
//        红包剩余：8
//        红包剩余：5
//        红包剩余：6
//        红包剩余：3
//        红包剩余：4
//        红包剩余：1
//        红包剩余：2
//        红包剩余：0


//        Thread-4---红包剩余：95
//        Thread-1---红包剩余：98
//        Thread-0---红包剩余：98
//        Thread-2---红包剩余：96
//        Thread-3---红包剩余：97
//        Thread-2---红包剩余：92
//        Thread-1---红包剩余：93
//        Thread-4---红包剩余：94
//        Thread-3---红包剩余：93
//        Thread-0---红包剩余：91
//        Thread-3---红包剩余：90
//        Thread-2---红包剩余：89
//        Thread-4---红包剩余：87
//        Thread-0---红包剩余：88
//        Thread-1---红包剩余：86
//        Thread-3---红包剩余：84
//        Thread-2---红包剩余：84
//        Thread-1---红包剩余：83
//        Thread-4---红包剩余：81
//        Thread-0---红包剩余：82
//        Thread-2---红包剩余：80
//        Thread-4---红包剩余：79
//        Thread-1---红包剩余：78
//        Thread-3---红包剩余：80
//        Thread-0---红包剩余：77
//        Thread-1---红包剩余：76
//        Thread-4---红包剩余：73
//        Thread-0---红包剩余：74
//        Thread-2---红包剩余：74
//        Thread-3---红包剩余：76
//        Thread-2---红包剩余：72
//        Thread-0---红包剩余：68
//        Thread-1---红包剩余：70
//        Thread-3---红包剩余：68
//        Thread-4---红包剩余：69
//        Thread-2---红包剩余：66
//        Thread-3---红包剩余：65
//        Thread-0---红包剩余：66
//        Thread-4---红包剩余：63
//        Thread-1---红包剩余：64
//        Thread-3---红包剩余：61
//        Thread-0---红包剩余：60
//        Thread-4---红包剩余：62
//        Thread-1---红包剩余：61
//        Thread-2---红包剩余：62
//        Thread-1---红包剩余：57
//        Thread-3---红包剩余：56
//        Thread-2---红包剩余：59
//        Thread-4---红包剩余：57
//        Thread-0---红包剩余：57
//        Thread-2---红包剩余：55
//        Thread-3---红包剩余：55
//        Thread-1---红包剩余：53
//        Thread-4---红包剩余：54
//        Thread-0---红包剩余：52
//        Thread-2---红包剩余：50
//        Thread-0---红包剩余：49
//        Thread-1---红包剩余：48
//        Thread-3---红包剩余：47
//        Thread-4---红包剩余：51
//        Thread-4---红包剩余：44
//        Thread-3---红包剩余：46
//        Thread-2---红包剩余：45
//        Thread-0---红包剩余：43
//        Thread-1---红包剩余：42
//        Thread-2---红包剩余：41
//        Thread-0---红包剩余：39
//        Thread-1---红包剩余：40
//        Thread-3---红包剩余：41
//        Thread-4---红包剩余：38
//        Thread-2---红包剩余：37
//        Thread-0---红包剩余：36
//        Thread-1---红包剩余：37
//        Thread-3---红包剩余：37
//        Thread-4---红包剩余：37
//        Thread-2---红包剩余：33
//        Thread-3---红包剩余：34
//        Thread-1---红包剩余：32
//        Thread-0---红包剩余：31
//        Thread-4---红包剩余：35
//        Thread-2---红包剩余：30
//        Thread-1---红包剩余：27
//        Thread-4---红包剩余：29
//        Thread-0---红包剩余：28
//        Thread-3---红包剩余：30
//        Thread-2---红包剩余：26
//        Thread-0---红包剩余：26
//        Thread-1---红包剩余：25
//        Thread-4---红包剩余：26
//        Thread-3---红包剩余：26
//        Thread-3---红包剩余：24
//        Thread-4---红包剩余：23
//        Thread-1---红包剩余：22
//        Thread-0---红包剩余：21
//        Thread-2---红包剩余：21
//        Thread-1---红包剩余：20
//        Thread-4---红包剩余：20
//        Thread-0---红包剩余：17
//        Thread-3---红包剩余：19
//        Thread-2---红包剩余：17
//        Thread-2---红包剩余：16
//        Thread-4---红包剩余：13
//        Thread-0---红包剩余：14
//        Thread-3---红包剩余：15
//        Thread-1---红包剩余：12
//        Thread-3---红包剩余：10
//        Thread-4---红包剩余：10
//        Thread-0---红包剩余：8
//        Thread-2---红包剩余：11
//        Thread-1---红包剩余：9
//        Thread-2---红包剩余：6
//        Thread-4---红包剩余：4
//        Thread-0---红包剩余：5
//        Thread-1---红包剩余：6
//        Thread-3---红包剩余：6
//        Thread-3---红包剩余：2
//        Thread-4---红包剩余：0
//        Thread-2---红包剩余：2
//        Thread-0---红包剩余：0
//        Thread-1---红包剩余：0




    }
}
